Repository: Pierre-Lannoy/wp-decalog
Catalog: .translations/wp-plugins-decalog-stable-readme-*.po
Languages: fr

source: Capture and log events, metrics and traces on your site. Make WordPress observable - finally!
fr: Capturez et journalisez les évènements, les métriques et les traces sur votre site. Rendez WordPress observable - enfin !

source: Visit 'PerfOps One &gt; Control Center &gt; DecaLog' in the left-hand menu of your WP Admin to adjust settings.
fr: Visitez « PerfOps One > Centre de contrôle > DecaLog » dans le menu gauche de votre panneau d’administration pour ajuster les réglages.

source: 🎁 Give this plugin a drive test on a free dummy site: <a href="https://tastewp.com/new/?pre-installed-plugin-slug=decalog">One-Click Test!</a>
fr: 🎁 Essayez cette extension sur un site factice gratuit : <a href="https://tastewp.com/new/?pre-installed-plugin-slug=decalog">test en un clic !</a>

source: Metrics Seen in InfluxDB (example of external service)
fr: Métriques vues dans InfluxDB (exemple de service externe)

source: Events &amp; Traces Seen in Grafana (example of external service)
fr: Évènements et traces vues dans Grafana (exemple de service externe)

source: Developer's documentation can be found in the <a href="https://decalog.io/">DecaLog SDK Documentation</a>.
fr: La documentation du développeur se trouve dans la documentation du <a href="https://decalog.io/">SDK DecaLog</a>.

source: If you're a plugins / themes developer and want to take advantage of the logging features of DecaLog, there's a <a href="https://decalog.io/">DecaLog SDK</a> for you.
fr: Si vous êtes un développeur d’extension ou thèmes et que vous souhaitez profiter des fonctionnalités de journalisation de DecaLog, il existe un <a href="https://decalog.io/">SDK DecaLog</a> pour vous.

source: <strong>DecaLog</strong> is part of <a href="https://perfops.one/">PerfOps One</a>, a suite of free and open source WordPress plugins dedicated to observability and operations performance.
fr: <strong>DecaLog</strong> fait partie de <a href="https://perfops.one/">PerfOps One</a>, une suite d’extensions WordPress gratuites et open source dédiées à l’observabilité et aux performances des opérations.

source: <strong>DecaLog</strong> can be used in dev/debug phases or on production sites: it has nearly no resource impact on the server. It provides an extensive set of WP-CLI commands to help operations too.
fr: <strong>DecaLog</strong> peut être utilisé dans les phases de développement/débogage ou sur les sites en production : il n’a presque aucun impact sur les ressources du serveur. Il fournit aussi un ensemble complet de commandes WP-CLI pour faciliter les opérations.

source: For a full list of supported - internal or third-party - services please, jump to the official <a href="https://perfops.one/decalog#services">supported services list</a>.
fr: Pour une liste complète des services utilisables - internes ou tiers - merci de consulter la liste officielle des <a href="https://perfops.one/decalog#services">services pris en charge</a>.

source: If you don't want to use external services, <strong>DecaLog</strong> provides the tools to leverage all the benefits of observability right in the WordPress admin dashboard. It supports multisite logs delegation and contains many features to help to protect personal information (user pseudonymization, IP obfuscation, etc.).
fr: Si vous ne souhaitez pas utiliser de services externes, <strong>DecaLog</strong> fournit tous les outils pour tirer pleinement partie de l’observabilité, directement dans le tableau de bord d’administration WordPress. Il prend en charge la délégation de journaux multisite et contient de nombreuses fonctionnalités pour aider à protéger les informations personnelles (pseudonymisation des utilisateurs, obscurcissement IP, etc.).

source: <strong>DecaLog</strong> captures events generated by WordPress core, PHP, database, plugins and themes, collates metrics and KPIs and follows traces of the full WordPress execution. It has the ability to enrich these events, metrics and traces with many details regarding their triggering, before storing them in WordPress database or passing them to external services.
fr: <strong>DecaLog</strong> capture les évènements générés par le cœur de WordPress, PHP, la base de données, les extensions et thèmes, calcule les métriques et les KPI et suit les traces de l’exécution complète de WordPress. Il a la capacité d’enrichir ces événements, métriques et traces avec de nombreux détails concernant leur déclenchement, avant de les stocker dans la base de données WordPress ou de les transmettre à des services externes.

source: De-facto standard stack for WordPress observability, <strong>DecaLog</strong> provides reliable and powerful logging, monitoring and tracing features for WordPress core, PHP, database, plugins and themes.
fr: Standard de fait pour l’observabilité de WordPress, <strong>DecaLog</strong> fournit des fonctionnalités de journalisation, de surveillance et de traçage fiables et puissantes pour le cœur de WordPress, PHP, la base de données, les extensions et les thèmes.

source: <strong>Capture and log events, metrics and traces on your site. Make WordPress observable - finally!</strong>
fr: <strong>Capturez et journalisez les événements, les métriques et les traces sur votre site. Rendez WordPress observable - enfin !</strong>

source: Live Events with In-browser Console
fr: Console en direct dans le navigateur

source: Trace Details in Internal Viewer
fr: Détail de la trace avec la visionneuse interne

source: WordPress Traces List
fr: Journal des traces WordPress

source: WordPress Events Log
fr: Journal des évènements WordPress

source: Available Loggers Types
fr: Types de journaliseurs disponibles

source: Running Loggers List
fr: Liste des journaliseurs

source: This plugin may handle personally identifiable information (PII). If the GDPR or CCPA or similar regulation applies to your case, you must use the anonymization options embedded in the plugin and/or adapt your processes (consent management, security measure, treatment register, etc.).
fr: Cette extension peut traiter des données à caractère personnel (DCP). Si le RGPD ou le CCPA ou un règlement similaire s’applique à votre cas, vous devez utiliser les options d’anonymisation intégrées dans l’extension et/ou adapter vos processus (gestion du consentement, mesure de sécurité, registre des traitements, etc.).

source: This plugin doesn't set any cookie in the user's browser.
fr: Cette extension ne dépose pas de cookie dans le navigateur de l’utilisatrice ou de l’utilisateur.

source: This plugin, as any piece of software, is neither compliant nor non-compliant with privacy laws and regulations. It is your responsibility to use it - by activating the corresponding options or services - with respect for the personal data of your users and applicable laws.
fr: Cette extension, comme tout autre logiciel, n’est ni conforme ni non conforme aux lois et règlements sur la protection de la vie privée. Il est de votre responsabilité de l’utiliser - en activant les options ou services correspondants - dans le respect des données personnelles de vos utilisatrices et utilisateurs ainsi que des lois applicables.

source: Privacy
fr: Confidentialité

source: Event Details in Internal Viewer
fr: Détail de l’évènement avec la visionneuse interne

source: You can report bugs and suggest ideas via the <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues">GitHub issue tracker</a> of the plugin.
fr: Vous pouvez signaler des bogues et suggérer des améliorations via le <a href="https://github.com/Pierre-Lannoy/wp-decalog/issues">suivi d’incidents GitHub</a> de l’extension.

source: Documentation for users is provided as the form of inline help in the plugin.
fr: La documentation pour les utilisatrices et utilisateurs est fournie sous forme d’aide en ligne dans l’extension.

source: Support is provided via the official <a href="https://wordpress.org/support/plugin/decalog/">WordPress page</a>.
fr: L’assistance est proposée via la page officielle <a href="https://wordpress.org/support/plugin/decalog/">d’assistance</a>.

source: Yes. It is designed to work on multisite too. Network Admins can configure the plugin and have access to all logs. Sites Admins have access to the logs of their own sites only.
fr: Oui. Cette extension est conçue pour fonctionner sur un multisite aussi. Les administrateurs du réseau peuvent configurer l’extension et avoir accès à tous les journaux. Les administrateurs de sites ont juste accès aux journaux de leurs sites.

source: You need at least <strong>WordPress 5.2</strong> and <strong>PHP 7.2</strong>.
fr: Vous avez besoin d’au moins <strong>WordPress 5.2</strong> et <strong>PHP 7.2</strong>.

source: Where can I report a bug?
fr: Où puis-je signaler un bogue ?

source: Where can I find documentation?
fr: Où puis-je trouver la documentation ?

source: Where can I get support?
fr: Où puis-je obtenir de l’aide ?

source: Can this plugin work on multisite?
fr: Cette extension fonctionne-t’elle sur un multisite ?

source: What are the requirements for this plugin to work?
fr: Quels sont les prérequis pour que cette extension fonctionne ?

source: Enjoy!
fr: Profitez !

source: Activate DecaLog from your Plugins page.
fr: Activez DecaLog depuis la page des extensions.

source: Upload the <code>decalog</code> directory to your <code>/wp-content/plugins/</code> directory, using your favorite method (ftp, sftp, scp, etc...).
fr: Téléversez le dossier <code>decalog</code> dans votre dossier <code>/wp-content/plugins/</code>, en utilisant votre méthode préférée (ftp, sftp, scp, etc.).

source: Download DecaLog.
fr: Téléchargez DecaLog.

source: Activate DecaLog.
fr: Activez DecaLog.

source: Click on the 'Install Now' button.
fr: Cliquez sur le bouton « Installer maintenant ».

source: Search for 'DecaLog'.
fr: Cherchez « DecaLog ».

source: Visit 'Plugins &gt; Add New'.
fr: Visitez « Extensions &gt; Ajouter ».

source: Once Activated
fr: Une fois activé

source: From WordPress.org
fr: Depuis WordPress.org

source: From your WordPress dashboard
fr: Depuis votre Tableau de bord WordPress

source: If you like this plugin or find it useful and want to thank me for the work done, please consider making a donation to <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> or the <a href="https://www.eff.org/">Electronic Frontier Foundation</a> which are advocacy groups defending the rights and freedoms of citizens on the Internet. By supporting them, you help the daily actions they perform to defend our fundamental freedoms!
fr: Si vous aimez cette extension ou la trouvez utile et que vous voulez me remercier pour le travail accompli, vous pouvez faire un don à <a href="https://www.laquadrature.net/en">La Quadrature Du Net</a> ou l’<a href="https://www.eff.org/">Electronic Frontier Foundation</a> qui sont des associations de défense des droits et libertés des citoyens sur Internet. En les soutenant, vous aidez les actions quotidiennes qu’ils accomplissent pour défendre nos libertés fondamentales !

source: Anyway, I'll be glad to help you if you encounter issues when using this plugin. Just use the support section of this plugin page.
fr: Dans tous les cas, je serai heureux de vous apporter mon assistance si vous rencontrez des problèmes lors de l’utilisation de cette extension. Merci de me contacter via la page support de ce site.

source: This plugin is free and provided without warranty of any kind. Use it at your own risk, I'm not responsible for any improper use of this plugin, nor for any damage it might cause to your site. Always backup all your data before installing a new plugin.
fr: Cette extension est gratuite et distribuée sans aucune garantie d’aucune sorte. Son utilisation se fait à vos risques et périls, je ne saurais être tenu responsable d’aucun dommage que son utilisation pourrait causer à votre site. Pensez à toujours sauvegarder vos données avant d’installer une nouvelle extension.

source: Donation
fr: Don

source: Support
fr: Assistance

source: Developers
fr: Développeurs

source: Please, see <a href="https://perfops.one/decalog-changelog">full changelog</a>.
fr: Merci de consulter le <a href="https://perfops.one/decalog-changelog">journal des modifications</a>.
